In [2]:
'''Groupby is the process to group the same row of a column for that we use group by function
to understand groupby we create a data frame
here we can use statistics'''
import pandas as pd 
import numpy as np

data = {'Company': ['goog','mcrsft','Fb','goog','Fb','mcrsft','goog','mcrsft','Fb'],
         'Employee': ['sam','nam','qam','wam','asam','ndam','qgam','ham','niiik'],
         'Salary': [500,800,4500,2200,2222,7899,2100,3222,9899,] }
df = pd.DataFrame(data)    
df

  Company Employee  Salary
0    goog      sam     500
1  mcrsft      nam     800
2      Fb      qam    4500
3    goog      wam    2200
4      Fb     asam    2222
5  mcrsft     ndam    7899
6    goog     qgam    2100
7  mcrsft      ham    3222
8      Fb    niiik    9899

In [8]:
by_company = df.groupby('Company')

In [13]:
by_company.mean()

              Salary
Company
Fb       5540.333333
goog     1600.000000
mcrsft   3973.666667

In [14]:
by_company.sum().loc['Fb']

Salary    16621
Name: Fb, dtype: int64

In [12]:
by_company.std()

              Salary
Company
Fb       3942.816548
goog      953.939201
mcrsft   3608.698149

In [16]:
df.min()

Company       Fb
Employee    asam
Salary       500
dtype: object

In [17]:
df.max()

Company     mcrsft
Employee       wam
Salary        9899
dtype: object

In [19]:
df.describe()

            Salary
count     9.000000
mean   3704.666667
std    3212.708631
min     500.000000
25%    2100.000000
50%    2222.000000
75%    4500.000000
max    9899.000000

In [24]:
df
df.groupby('Company').describe().transpose()

Company                Fb         goog       mcrsft
Salary count     3.000000     3.000000     3.000000
       mean   5540.333333  1600.000000  3973.666667
       std    3942.816548   953.939201  3608.698149
       min    2222.000000   500.000000   800.000000
       25%    3361.000000  1300.000000  2011.000000
       50%    4500.000000  2100.000000  3222.000000
       75%    7199.500000  2150.000000  5560.500000
       max    9899.000000  2200.000000  7899.000000